[
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a sport you enjoy watching\nYou should say:\n- What it is\n- Where you watch it\n- Who do you watch it with\n- And explain why you enjoyed watching the program",
        "Part 3": [
            "1. Which sport do you think most people like to do? And why?",
            "2. Do children need exercise?",
            "3. What are the benefits of exercise?",
            "4. What can be done to get children into sports?",
            "5. What sports programs do people like to watch in your country?",
            "6. What's the difference between watching sports on TV and watching it live?"
        ],
        "Index": 1
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe someone you know who has recently moved to a new place\nYou should say:\n- Who he/she is\n- What the new place is like\n- Why he/she moved to a new place\n- And explain whether his or her move has a positive impact on you",
        "Part 3": [
            "1. Why do some young people keep moving?",
            "2. What's the difference between living alone and living with roommates?",
            "3. Is it positive for young people to live by themselves?",
            "4. Besides cooking, are there any other skills that people need to learn if they live on their own?",
            "5. What kinds of people tend to live by themselves?",
            "6. How can parents and teachers help young people to live independently?"
        ],
        "Index": 2
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe an interesting job that you want to have in the future\nYou should say:\n- What it is\n- How you can find this job\n- What skills it requires\n- And explain why it is an interesting job",
        "Part 3": [
            "1. What are the most popular jobs for young people in your country?",
            "2. What is the difference between high-income and low-income jobs in your country?",
            "3. When is the right time for young people to start making serious plans for their future careers?",
            "4. Which jobs have the highest salaries?",
            "5. Which jobs pay low wages but require a high level of skills?",
            "6. Do you think it is important for secondary schools to offer careers advice to students?"
        ],
        "Index": 3
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe an important decision that you made\nYou should say:\n- What the decision was\nHow you made your decision\nWhat the results of the decision were\nAnd explain why it was important",
        "Part 3": [
            "1. Do you think children sometimes have to make important decisions?",
            "2. What important decisions do teenagers need to make after graduation?",
            "3. Who can children turn to for help when making a decision?",
            "4. Do you think advertisements can influence our decisions when shopping?",
            "5. Do you think the influence of advertising is good?",
            "6. How do people usually make an important decision?"
        ],
        "Index": 4
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a water sport you would like to try in the future\nYou should say:\nWhat it is\nWhere you would like to try it\nWhether it is difficult\nAnd explain why you would like to try it",
        "Part 3": [
            "1. What are the advantages of water transportation?",
            "2. Why do people like to live near water?",
            "3. What kinds of water sports are popular nowadays?",
            "4. Do you think it is good to teach swimming in schools?",
            "5. What do you think of the people who waste water?",
            "6. What are the characteristics of goods transported by water?"
        ],
        "Index": 5
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a famous person you are interested in\nYou should say:\nWho he/she is\nHow you knew about him/her\nWhat he/she was like before he/she became famous\nAnd explain why you are interested in him/her",
        "Part 3": [
            "1. Do you think media is putting too much attention on famous people?",
            "2. Do you think famous people are necessarily good in their fields?",
            "3. What are the differences between famous people today and those in the past?",
            "4. What kinds of famous people are there in your country?",
            "5. Why are some kids popular at school?",
            "6. Why do some people become famous but not successful?"
        ],
        "Index": 6
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe an occasion when you lost your way\nYou should say:\nWhere you were\nWhat happened\nHow you felt\nAnd explain how you found your way",
        "Part 3": [
            "1. How can people find their way when they are lost?",
            "2. Do you think it is important to do some preparation before you travel to new places?",
            "3. Do you think it is important to be able to read a map?",
            "4. Is a paper map still necessary?",
            "5. Why do some people get lost more easily than others?",
            "6. How do people react when they get lost?"
        ],
        "Index": 7
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a movie you watched recently that you felt disappointed about\nYou should say:\nWhat it is\nWhat it is about\nWhy you decided to watch it\nAnd explain why you felt disappointed about it",
        "Part 3": [
            "1. Do you believe in movie reviews?",
            "2. What are the different types of films in your country?",
            "3. Are historical films popular in your country? Why?",
            "4. Do you think films with famous actors or actresses would be more popular?",
            "5. Why are Japanese animated films so popular?",
            "6. Should the director pay a lot of money to famous actors?"
        ],
        "Index": 8
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a car journey that you remember well\nYou should say:\nWhere you went\nWhat you did\nWho you had the car journey with\nAnd explain how you felt about the journey",
        "Part 3": [
            "1. What benefits does public transport bring to the world?",
            "2. Is it too late for people to get the driver licence at the age of 18?",
            "3. What qualities does a driver need to have?",
            "4. Do you think the government should make it a rule for people to use public transport?",
            "5. Which jobs require people to be good at driving?",
            "6. Do you see driverless cars as the future of cars?"
        ],
        "Index": 9
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe someone you know who often helps others\nYou should say:\nWhat he/she is like\nHow he/she helps others\nWhy his/her help is beneficial\nAnd explain why he/she helps others",
        "Part 3": [
            "1. How can children help their parents at home?",
            "2. Should children be taught to help others?",
            "3. What makes children help each other at school?",
            "4. Should students do community service? Why?",
            "5. Do students in your country do volunteer work?",
            "6. Why do some people do volunteer work all over the world?"
        ],
        "Index": 10
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a traditional celebration in your country that you enjoy\nYou should say:\nWhat it is\nWhat do you do to celebrate it\nWho do you celebrate it with\nAnd explain why you enjoy it",
        "Part 3": [
            "1. Is it important for children to learn about traditional festivals at school?",
            "2. Do children like to learn about traditional festivals?",
            "3. Why do people hold events to celebrate?",
            "4. Are traditional festivals disappearing?",
            "5. Is music important in traditional festivals?",
            "6. Do you think good food and drinks are important for celebrations?"
        ],
        "Index": 11
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a place away from your home and you want to visit in the future\nYou should say:\nWhere you would like to go\nWhen you would like to go\nWho do you want to go with\nAnd explain why you want to visit the place",
        "Part 3": [
            "1. Where do people usually travel on holidays?",
            "2. Why do some people think it is enjoyable to stay at home on holiday?",
            "3. How do students who have taken a gap year differ from other students?",
            "4. Do teenagers usually travel with friends or alone?",
            "5. What do you think is the most desirable place for people to visit during the holiday?",
            "6. What does tourism have to do with cultural exchange?"
        ],
        "Index": 12
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe an occasion when you spent time with a young child\nYou should say:\nWho this child was\nWhen you spent time with this child\nWhat you did together\nAnd how you felt about it",
        "Part 3": [
            "1. Do you think children should have a lot of toys?",
            "2. Where do children usually play?",
            "3. Do you think there are too many rules for children to follow, whether at school or at home?",
            "4. Do you think children should follow all the rules?",
            "5. Do you think it's necessary for parents to make decisions for their children?",
            "6. Do you think it is good for parents to help their children choose friends?"
        ],
        "Index": 13
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe an occasion when you got incorrect information\nYou should say:\nWhen you got it\nHow you got it\nHow you found it was incorrect\nAnd how you felt about it",
        "Part 3": [
            "1. Why don't people trust information on the Internet?",
            "2. What jobs provide information to others?",
            "3. What's the difference between e-mail and phone in terms of providing information?",
            "4. Which do you think is the better way to provide information, by phone or by email?",
            "5. How do people judge the accuracy of information?",
            "6. How do people make sure they're getting the right information?"
        ],
        "Index": 14
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a place you have been to where there were lots of people\nYou should say:\nWhere it is\nWho you were with\nWhat people were doing there\nAnd explain why there were lots of people",
        "Part 3": [
            "1. Where do young people like to go?",
            "2. Are people happy living in crowded apartments?",
            "3. Which scenic spots will have queues of people?",
            "4. What are the advantages of living on a high floor?",
            "5. What are the disadvantages of living on a lower floor?",
            "6. What do you think of the phenomenon of people queuing in restaurants for more than an",
            "hour?"
        ],
        "Index": 15
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a speech that you gave in public\nYou should say:\nWho do you gave the speech to\nWhat the speech was about\nWhy you gave the speech\nAnd explain how you felt about the speech",
        "Part 3": [
            ":",
            "1. What benefits does the internet bring to communication?",
            "2. Which one is better, being a communicator or a listener?",
            "3. What qualities does a person need to have to be a communicator?",
            "4. What qualities do people need to speak in public?",
            "5. What kinds of people often give speeches?",
            "6. How important it is to be a good listener in communication?"
        ],
        "Index": 16
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a happy experience in your childhood\nYou should say:\nWhat it is\nWho you were with\nWhat you did\nAnd explain why you felt happy",
        "Part 3": [
            "1. Why do you think some people have better memory than others?",
            "2. What kinds of things do people prefer to remember nowadays?",
            "3. What do you think we shouldn't forget?",
            "4. Why do some people remember more of their childhood than others?",
            "5. What can people do to improve their memory?",
            "6. What is your earliest memory that you can still remember now?"
        ],
        "Index": 17
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a book that you have read many times\nYou should say:\nWhat the book is\nWhat is in this book\nHow often do you read this book?\nWhy did you read it\nAnd explain what effect the book has on you",
        "Part 3": [
            "1. What kinds of books do children like to read? Why?",
            "2. What can kids learn from books?",
            "3. Do people prefer to read e-books or printed books in your country?",
            "4. Do you think people need to develop the habit of reading? Why?",
            "5. Do you think reading books can make people happier?",
            "6. Do you think e-books will make people read more? Why?"
        ],
        "Index": 18
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe an exciting adventure you would like to take in the future\nYou should say:\nWhat the adventure is\nWhere you would go\nWho you would go with\nAnd explain why you would like to take the adventure",
        "Part 3": [
            "1. Who likes to read adventure books?",
            "2. Do people prefer adventure novels or adventure movies?",
            "3. Why do people like to read adventure books rather than take an adventure?",
            "4. Who doesn't like to take adventures?",
            "5. What kind of personality should people have in order to experience a lot of adventure?",
            "6. Will experiencing adventures broaden people's horizons?"
        ],
        "Index": 19
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe the ideal house you would like to have\nYou should say:\nWhere it would be\nWhat it is like\nWhat special features it has\nAnd explain why it would be your ideal house",
        "Part 3": [
            "1. What are the most common architectural styles cities in Vietnam?",
            "2. What's the difference between an apartment and a house?",
            "3. What's the difference between living in the countryside and living in the city?",
            "4. What are the advantages of the facilities of the apartment and the facilities of the house?",
            "5. What difficulties do people have living in the city?",
            "6. What can be done to reduce the stress of city life?"
        ],
        "Index": 20
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a piece of clothing you enjoy wearing\nYou should say:\nWhat it is like\nWhen and where you got it\nHow often you wear it\nAnd explain why you enjoy wearing it",
        "Part 3": [
            "1. Do you like buying clothes?",
            "2. What kind of clothes do most people wear in your country?",
            "3. Under what circumstances would people in your country wear formal clothes?",
            "4. What is the difference between the clothing of the elderly and the young in China?",
            "5. When do people in your country wear traditional clothes?",
            "6. Does the climate affect what people wear?"
        ],
        "Index": 21
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe the game you enjoyed playing when you were younger\nYou should say:\nWhat the game was\nWhere you played it\nWhom you played it with\nAnd explain why you enjoyed playing the game",
        "Part 3": [
            "1. What games do kids like to play now?",
            "2. Do boys and girls play different games?",
            "3. Are outdoor sports important for kids?",
            "4. Why do people play different games now than before?",
            "5. Is winning important in games?",
            "6. Which is better, individual games or team-based games?"
        ],
        "Index": 22
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a new shop that has recently opened in your city/town\nYou should say:\nWhere the shop is\nWhat it sells\nWho goes to this shop?\nAnd explain how successful you think it will be in the future",
        "Part 3": [
            "1. What kinds of shops are popular in your city?",
            "2. Why do young people enjoy going to some boutiques?",
            "3. Do you think location is the key factor that attracts customers?",
            "4. What is the difference between a small shop and a large shop?",
            "5. How important are price and quality in influencing consumer behaviour?",
            "6. Why is cheap fashion so popular?"
        ],
        "Index": 23
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe an expensive gift that you would like to give someone when you save a \nlot of money\nYou should say:\nWhat the gift is\nWho you will give the gift to\nHow long it will take to save the money\nAnd explain why you would like to give the gift to this person",
        "Part 3": [
            "1. What do young people like to save money for?",
            "2. Is it easy for people to save money to buy something expensive?",
            "3. Should children have pocket money? Why?",
            "4. Should children learn how to use money at school or from their parents?",
            "5. How do people save money?",
            "6. Why can't some people save money?"
        ],
        "Index": 24
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a noisy place you have been to\nYou should say:\nWhere it is\nWhen you went there\nWhat you did there\nAnd explain why you feel it's a noisy place",
        "Part 3": [
            "1. Do you think it is good for children to make noise?",
            "2. Should children not be allowed to make noise under any circumstances?",
            "3. What kinds of noises are there in our life?",
            "4. Which area is exposed to noise more, the city or the countryside?",
            "5. How would people usually respond to noises in your country?",
            "6. How can people consider others' feelings when chatting in public?"
        ],
        "Index": 25
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe your favorite place in your house where you can relax\nYou should say:\nWhere it is\nWhat it is like\nWhat do you enjoy doing there\nAnd explain why you feel relaxed at this place",
        "Part 3": [
            "1. Why is it difficult for some people to relax?",
            "2. What are the benefits of doing exercise?",
            "3. Do people in your country exercise after work?",
            "4. What is the place where people spend most of their time at home?",
            "5. Do you think there should be classes for training young people and children how to relax?",
            "6. Which is more important, mental relaxation or physical relaxation?"
        ],
        "Index": 26
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a place you visited where the air was polluted\nYou should say:\nWhere the place is\nWhen you visited it\nWhy the air was not good\nAnd explain how you felt about the place",
        "Part 3": [
            "1. Is there more pollution now than in the past?",
            "2. In what ways can air pollution be reduced effectively?",
            "3. Do you think the city is cleaner or dirtier than the countryside? Why?",
            "4. What can factories and power plants do to reduce pollutants?",
            "5. Do you think many companies have been forced to reduce pollutants?",
            "6. Do you think the wind has any effect on pollution? How?"
        ],
        "Index": 27
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a time when you taught a friend/relative something\nYou should say:\nWhom you taught\nWhat/how you taught\nWhat the result was\nAnd explain how you felt about the experience",
        "Part 3": [
            "1. What practical skills can young people teach old people?",
            "2. What skills can young people teach old people besides technology?",
            "3. How can young people teach old people skills?",
            "4. How can we know what to do when we want to learn something new?",
            "5. Do you think 'showing' is a better way than 'telling' in education?",
            "6. Do people in your country like to watch videos to learn something?"
        ],
        "Index": 28
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a new development in the area where you live (e.g. shopping mall, park, ...)\nYou should say:\nWhat and where the development is\nWhat it was like before\nHow long it took to complete it\nHow people feel about it\nAnd explain how it has improved the area you live in",
        "Part 3": [
            "1. What transportation do you use the most?",
            "2. Is public transportation popular in China?",
            "3. What can be done to improve public transport services in your hometown?",
            "4. What leisure facilities can be used by people of all ages?",
            "5. Do you think young people in your country like going to the cinema?",
            "6. How is the subway system developing in your country?"
        ],
        "Index": 29
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a historical period/moment you would like to learn more about\nYou should say:\nWhat you are interested in\nWhen it happened\nWhat you know about it\nAnd why you would like to learn more",
        "Part 3": [
            "1. Should everyone know history?",
            "2. In what ways can children learn history?",
            "3. What are the differences between learning history from books and from videos?",
            "4. Is it difficult to protect and preserve historic buildings?",
            "5. Who should be responsible for protecting historic buildings?",
            "6. Who should pay for the preservation of historic buildings?"
        ],
        "Index": 30
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe an unusual meal you had\nYou should say:\nWhen you had it\nWhere you had it\nWho you had it with\nAnd explain why it was unusual",
        "Part 3": [
            "1. What are the advantages and disadvantages of eating in restaurants?",
            "2. What fast food restaurants are there in your country?",
            "3. Do people eat fast food at home?",
            "4. Why do some people choose to eat out instead of ordering takeout?",
            "5. Do people in your country socialize in restaurants? Why?",
            "6. Do people in your country value food culture?"
        ],
        "Index": 31
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe another city you would like to stay for a short time\nYou should say:\nWhere the city is\nWhy you want to go there\nWhom you will go there with\nWhat you will do there\nAnd explain why you will stay there just for a short time",
        "Part 3": [
            "1. Why do people sometimes go to other cities or other countries to travel?",
            "2. Why are historical cities popular?",
            "3. Why do places with historical sites develop tourism industry more actively?",
            "4. Do you think tourists may come across bad things in other cities?",
            "5. Do most people like planned travelling?",
            "6. Why is the noise pollution worse in tourism cities than in other cities?"
        ],
        "Index": 32
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a time when you missed or were late for an important meeting/event\nYou should say:\nWhen it happened\nWhat happened\nWhy you missed/were late for it\nAnd explain how you felt about this experience",
        "Part 3": [
            "1. Are you a punctual person?",
            "2. Do you think it is important to be on time?",
            "3. Do you always avoid being late?",
            "4. Why are people often late for meetings or appointments?",
            "5. Are people in your country often late for meetings?",
            "6. Do you think people are born with time management skills or they can develop them?"
        ],
        "Index": 33
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe something you did that made you feel proud\nYou should say:\nWhat it was\nHow you did it\nWhat difficulty you had\nHow you dealt with the difficulty\nAnd explain why you felt proud of it",
        "Part 3": [
            "1. Which one is more important, personal goals or work goals?",
            "2. Have your life goals changed since your childhood?",
            "3. Does everyone set goals for themselves?",
            "4. What kinds of rewards are important at work?",
            "5. Do you think material rewards are more important than other rewards at work?",
            "6. What makes people feel proud of themselves?"
        ],
        "Index": 34
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe your first day at school that you remember\nYou should say:\nWhere the school was\nHow you went there\nWhat happened that day\nAnd how you felt on that day",
        "Part 3": [
            "1. What would parents prepare when their kids go to school on the first day?",
            "2. How do children socialize with each other?",
            "3. Is socialization important for children?",
            "4. What are the reasons for job change?",
            "5. Are big companies better than small companies? Why?",
            "6. What are the advantages and disadvantages coming along with changing jobs?"
        ],
        "Index": 35
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a daily routine that you enjoy\nYou should say:\nWhat it is\nWhere and when you do it\nWho do you do it with\nAnd explain why you enjoy it",
        "Part 3": [
            "1. Should children have learning routines?",
            "2. What are the advantages of children having a routine at school?",
            "3. Does having a routine make kids feel more secure at school?",
            "4. How do people's routines differ on weekdays and weekends?",
            "5. What daily routines do people have at home?",
            "6. What are the differences between people's daily routines now and in the last 15 years?"
        ],
        "Index": 36
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a complaint that you made and you were satisfied with the result\nYou should say:\nWhen it happened\nWhom you complained to\nWhat you complained about\nAnd explain why you were satisfied with the result",
        "Part 3": [
            "1. When are people more likely to make complaints?",
            "2. What do people often complain about?",
            "3. Which one is better when making a complaint, by talking or by writing?",
            "4. Who are more likely to make complaints, older people or younger people?",
            "5. How would you react if you received poor service at a restaurant?",
            "6. How do people often respond to poor customer service?"
        ],
        "Index": 37
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a time when someone gave you something that you really wanted\nYou should say:\nWhat it was\nWhen you received it\nWho gave it to you\nAnd explain why you wanted it so much",
        "Part 3": [
            "1. Should employees have their own goals?",
            "2. How should bosses reward employees?",
            "3. What kinds of gifts do young people like to receive as rewards?",
            "4. How should children spend their allowance money?",
            "5. Why do people like shopping more now than in the past?",
            "6. Do you think shopping is good for a country's economy?"
        ],
        "Index": 38
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe something that you did with someone/a group of people\nYou should say:\nWhat it was\nWho you did it with\nHow long it took you to do this\nAnd explain why you did it together",
        "Part 3": [
            "1. How do you get along with your neighbors?",
            "2. How do neighbors help each other?",
            "3. Do you think neighbors help each other more often in the countryside than in the city?",
            "4. How do children learn to cooperate with each other?",
            "5. Do you think parents should teach children how to cooperate with others? How?",
            "6. Do you think it's important for children to learn about cooperation?"
        ],
        "Index": 39
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a piece of good news that you heard about someone you know well\nYou should say:\nWhat it was\nWhen you heard it\nHow you knew it\nAnd explain how you felt about it",
        "Part 3": [
            "1. Is it good to share something on social media?",
            "2. Should the media only publish good news?",
            "3. How does social media help people access information?",
            "4. What kind of good news do people often share in the community?",
            "5. Do most people like to share good news with others?",
            "6. Do people like to hear good news from their friends?",
            "IELTS withDatio – TESOL with Datio Tư vấn lộ trình học: 028 73 099990",
            "20"
        ],
        "Index": 40
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe an activity you enjoyed in your free time when you were young\nYou should say:\nWhat it was\nWhere you did it\nWho you did it with\nAnd explain why you enjoyed it",
        "Part 3": [
            "1. Is it important to have a break during work or study?",
            "2. What sports do young people like to do now?",
            "3. Are there more activities for young people now than 20 years ago?",
            "4. Can most people balance work and life in China?",
            "5. What activities do children and adults do nowadays?",
            "6. Do adults and children have enough time for leisure activities nowadays?"
        ],
        "Index": 41
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a website you often visit\nYou should say:\nWhat it is about\nHow you found out about it\nHow often you visit it\nAnd explain why you often visit it",
        "Part 3": [
            "1. What are the most popular and least popular apps in China?",
            "2. What's the difference between the Internet and television?",
            "3. Why do some people like to read the news on the internet instead of getting it from TV?",
            "4. Is the library still necessary? Why?",
            "5. What kinds of people would still go to the library to read and study?",
            "6. What are the differences between old people and young people when they use the",
            "Internet?"
        ],
        "Index": 42
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe something you would like to learn in the future\nYou should say:\nWhat it is\nHow you would like to learn it\nWhere you would like to learn it\nWhy you would like to learn it\nAnd explain whether it's difficult to learn it",
        "Part 3": [
            "1. What's the most popular thing to learn nowadays?",
            "2. At what age should children start making their own decisions? Why?",
            "3. Which influences young people more when choosing a course, income or interest?",
            "4. Do young people take their parents' advice when choosing a major?",
            "5. Besides parents, who else would people take advice from?",
            "6. Why do some people prefer to study alone?"
        ],
        "Index": 43
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a piece of technology you own that you feel is difficult to use\nYou should say:\nWhen you got it\nWhat you got it for\nHow often you use it\nAnd explain how you feel about it",
        "Part 3": [
            "1. What technology do people currently use?",
            "2. Why do big companies introduce new products frequently?",
            "3. Why are people so keen on buying iPhones even though they haven't changed much from one to the next?",
            "4. Why do technology companies keep upgrading their products?",
            "5. What changes has the development of technology brought about in our lives?",
            "6. Does the development of technology affect the way we study? How?"
        ],
        "Index": 44
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe an advertisement you have seen but you did not like\nYou should say:\nWhere and when you saw it\nWhat the advertisement was for\nWhat you could see in the advertisement\nAnd explain why you did not like the advertisement",
        "Part 3": [
            "1. What are the most advertised products in your country?",
            "2. Which one is more effective, newspaper advertising or online advertising?",
            "3. What are the benefits of advertising?",
            "4. What do you think of celebrity endorsements in advertising?",
            "5. Does advertising encourage us to buy things we don't need?",
            "6. What role does social media play in advertising?"
        ],
        "Index": 45
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a person you met at a party who you enjoyed talking with\nYou should say:\nWhat party it was\nWho this person is\nWhat you talked about\nAnd explain why you enjoyed talking with him/her",
        "Part 3": [
            "1. In what situations would people be willing to get to know new people?",
            "2. Where do people go to meet new people?",
            "3. How do people start a conversation?",
            "4. Is it difficult for Chinese people to communicate with people from other countries?",
            "5. Why are some people unwilling to have conversations with others?",
            "6. Is it difficult for adults to talk with children?"
        ],
        "Index": 46
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a person you have met who you want to work/study with\nYou should say:\nWho this person is\nHow you met this person\nHow long you have known him/her\nAnd explain why you want to work/study with him/her",
        "Part 3": [
            "1. Why should children be kind to their classmates?",
            "2. Can children choose their deskmates?",
            "3. What matters most about a colleague's personality?",
            "4. Are good colleagues important at work?",
            "5. What kind of people are popular at work?",
            "6. Are knowledgeable people popular at work?"
        ],
        "Index": 47
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe an interesting old person you have met\nYou should say:\nWho this person is\nWhen/where you met this person\nWhat you did with this person\nAnd explain why you think this person is interesting",
        "Part 3": [
            "1. Do you think old people and young people can share interests?",
            "2. What can old people teach young people?",
            "3. Is it easy for young people and old people to make friends with each other?",
            "4. Are there benefits when one person is interested in another person? Why?",
            "5. Do you think people are more selfish or self-centered now than in the past?",
            "6. What benefits can people get if they are self-centered?"
        ],
        "Index": 48
    },
    {
        "Section": "IELTS Speaking Part 2 and 3",
        "Part 2": "Describe a film character played by an actor or actress whom you admire\nYou should say:\nWho this actor/actress is\nWhen you saw the film\nWhat the character was like in this film\nAnd explain why yo admire this actor/actress",
        "Part 3": [
            "1. Are actors or actresses very interested in their work? Why?",
            "2. Is being a professional actor or actress a good career?",
            "3. What can children learn from acting?",
            "4. Why do children like special costumes?",
            "5. What are the differences between actors or actresses who earn much and those who earn little?",
            "6. What are the differences between acting in a theatre and that in a film?"
        ],
        "Index": 49
    }
]